# PROJECT TITLE : GLOBAL SEISMIC TRENDS: DATA - DRIVEN EARTHQUAKE INSIGHTS

## SQL QUERIES - COMPLETE SET OF 26 STATEMENTS

In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine, text

engine = create_engine("mysql+pymysql://root:Mohajaya%400706@localhost/")

with engine.connect() as conn:
    print("Connected successfully from Jupyter!")

Connected successfully from Jupyter!

In [3]:
with engine.connect() as conn:
    conn.execute(text("CREATE DATABASE IF NOT EXISTS earthquake_db1"))

In [4]:
engine=create_engine("mysql+pymysql://root:Mohajaya%400706@localhost/earthquake_db1")
print("MYSQL engine connected successfully")

MYSQL engine connected successfully

### Magnitude & Depth

In [ ]:
Query 1 : Top 10 strongest earthquakes (mag)

In [5]:
query1 = pd.read_sql("""
SELECT 
    id,
    place,
    mag,
    depth_km,
    time,
    country
FROM earthquakes
ORDER BY mag DESC
LIMIT 10;
""", engine)

query1

,id,place,mag,depth_km,time,country
0,us6000qw60,"2025 Kamchatka Peninsula, Russia Earthquake",8.8,35.000,2025-07-29 23:24:52,Russia Earthquake
1,ak0219neiszm,"2021 Chignik, Alaska Earthquake",8.2,35.000,2021-07-29 06:15:49,Alaska Earthquake
2,us6000f53e,2021 South Sandwich Islands Earthquake,8.1,22.790,2021-08-12 18:35:17,Unknown
3,us7000dflf,"2021 Kermadec Islands, New Zealand Earthquake",8.1,28.930,2021-03-04 19:28:33,New Zealand Earthquake
4,us7000qx2g,"140 km E of Petropavlovsk-Kamchatsky, Russia",7.8,27.000,2025-09-18 18:58:15,Russia
5,us6000jllz,"Pazarcik earthquake, Kahramanmaras earthquake ...",7.8,10.000,2023-02-06 01:17:34,Kahramanmaras earthquake sequence
6,us6000kd0n,southeast of the Loyalty Islands,7.7,18.053,2023-05-19 02:57:03,Unknown
7,us7000pn9s,"2025 Mandalay, Burma (Myanmar) Earthquake",7.7,10.000,2025-03-28 06:20:53,Unknown
8,us6000dg77,southeast of the Loyalty Islands,7.7,10.000,2021-02-10 13:19:56,Unknown
9,us7000pcdl,"210 km SSW of George Town, Cayman Islands",7.6,14.326,2025-02-08 23:23:15,Cayman Islands

In [ ]:
Query 2 : Top 10 deepest earthquakes (depth_km)

In [6]:
query2 = pd.read_sql("""
SELECT 
    id,
    place,
    mag,
    depth_km,
    time,
    country
FROM earthquakes
ORDER BY depth_km DESC
LIMIT 10;
""", engine)

query2

,id,place,mag,depth_km,time,country
0,us6000k2db,"208 km ENE of Sola, Vanuatu",4.0,681.238,2023-04-01 18:09:17,Vanuatu
1,us7000kxdn,Vanuatu region,4.2,675.265,2023-09-18 15:35:27,Unknown
2,us6000mivr,Fiji region,4.2,671.043,2024-03-08 22:42:24,Unknown
3,us6000rk66,"205 km ESE of Levuka, Fiji",4.8,669.556,2025-10-29 17:07:34,Fiji
4,us6000f2w3,"283 km SE of Levuka, Fiji",4.0,669.460,2021-08-01 22:12:46,Fiji
5,us7000q1jk,"299 km E of Levuka, Fiji",4.2,667.237,2025-05-10 02:03:17,Fiji
6,us6000dhfx,south of the Fiji Islands,4.5,664.740,2021-02-13 16:26:42,Unknown
7,us7000he64,"279 km ESE of Labasa, Fiji",4.3,664.700,2022-06-01 18:41:01,Fiji
8,us6000m2wg,"138 km NE of Sola, Vanuatu",4.1,660.826,2023-12-31 02:19:27,Vanuatu
9,us7000ingi,south of the Fiji Islands,7.0,660.000,2022-11-09 09:51:04,Unknown

In [ ]:
Query 3 : Shallow earthquakes < 50 km and mag > 7.5

In [7]:
query3 = pd.read_sql("""
SELECT 
    id,
    place,
    mag,
    depth_km,
    time,
    country
FROM earthquakes
WHERE depth_km < 50
  AND mag > 7.5
ORDER BY mag DESC;
""", engine)

query3

,id,place,mag,depth_km,time,country
0,us6000qw60,"2025 Kamchatka Peninsula, Russia Earthquake",8.8,35.000,2025-07-29 23:24:52,Russia Earthquake
1,ak0219neiszm,"2021 Chignik, Alaska Earthquake",8.2,35.000,2021-07-29 06:15:49,Alaska Earthquake
2,us7000dflf,"2021 Kermadec Islands, New Zealand Earthquake",8.1,28.930,2021-03-04 19:28:33,New Zealand Earthquake
3,us6000f53e,2021 South Sandwich Islands Earthquake,8.1,22.790,2021-08-12 18:35:17,Unknown
4,us6000jllz,"Pazarcik earthquake, Kahramanmaras earthquake ...",7.8,10.000,2023-02-06 01:17:34,Kahramanmaras earthquake sequence
5,us7000qx2g,"140 km E of Petropavlovsk-Kamchatsky, Russia",7.8,27.000,2025-09-18 18:58:15,Russia
6,us6000dg77,southeast of the Loyalty Islands,7.7,10.000,2021-02-10 13:19:56,Unknown
7,us6000kd0n,southeast of the Loyalty Islands,7.7,18.053,2023-05-19 02:57:03,Unknown
8,us7000pn9s,"2025 Mandalay, Burma (Myanmar) Earthquake",7.7,10.000,2025-03-28 06:20:53,Unknown
9,us7000i9bw,"35 km SSW of Aguililla, Mexico",7.6,26.943,2022-09-19 18:05:08,Mexico
10,us7000lff4,"19 km E of Gamut, Philippines",7.6,40.000,2023-12-02 14:37:04,Philippines
11,us7000pcdl,"210 km SSW of George Town, Cayman Islands",7.6,14.326,2025-02-08 23:23:15,Cayman Islands
12,us6000rgf4,Drake Passage,7.6,5.639,2025-10-10 20:29:20,Unknown
13,us6000rtdt,"2025 Aomori Prefecture, Japan Earthquake",7.6,45.351,2025-12-08 14:15:10,Japan Earthquake

In [ ]:
Query 4 : Average magnitude per magnitude type (magType)

In [8]:
query4 = pd.read_sql("""
SELECT 
    magType,
    AVG(mag) AS avg_magnitude
FROM earthquakes
GROUP BY magType
ORDER BY avg_magnitude DESC;
""", engine)

query4

       magType  avg_magnitude
0          mwc       6.150000
1          mwb       5.803448
2        ms_20       5.800000
3          mww       5.373946
4          mwp       5.250000
5        ms_vx       4.600000
6           mb       4.426347
7          mwr       4.344780
8           mw       3.938397
9          mlr       3.480000
10         mlg       3.300000
11       mb_lg       2.621331
12         mlv       2.190611
13  ml(texnet)       2.008778
14          mh       1.852604
15          md       1.813621
16          ml       1.726125

### Time Analysis

In [ ]:
Query 5 : Year with most earthquakes

In [9]:
query5= pd.read_sql("""
SELECT 
    year,
    COUNT(*) AS earthquake_count
FROM earthquakes
GROUP BY year
ORDER BY earthquake_count DESC;
""", engine)

query5

   year  earthquake_count
0  2021            117512
1  2022            107448
2  2024            107362
3  2023            106802
4  2025             93335
5  2026              5259

In [ ]:
Query 6 : Month with highest number of earthquakes

In [11]:
query6 = pd.read_sql("""
SELECT 
    monthname(time) AS month,
    COUNT(*) AS earthquake_count
FROM earthquakes
GROUP BY monthname(time),month(time)
ORDER BY earthquake_count DESC;
""", engine)

query6

        month  earthquake_count
0     January             52556
1        July             50348
2      August             47687
3       March             47332
4    December             46135
5       April             43072
6    February             42603
7   September             42495
8     October             42319
9        June             42195
10        May             41247
11   November             39729

In [ ]:
Query 7 : Day of week with most earthquakes

In [5]:
query7 = pd.read_sql("""
SELECT 
    day_of_week,
    COUNT(*) AS earthquake_count
FROM earthquakes
GROUP BY day_of_week
ORDER BY FIELD(day_of_week,'Monday','Tuesday','Wednesday','Thursday',
'Friday','Saturday','Sunday');
""", engine)

query7

  day_of_week  earthquake_count
0      Monday             77806
1     Tuesday             77038
2   Wednesday             77544
3    Thursday             77486
4      Friday             77391
5    Saturday             75282
6      Sunday             75171

In [ ]:
Query 8 : Count of earthquakes per hour of day

In [7]:
query8 = pd.read_sql("""
SELECT 
    DATE_FORMAT(time, '%%H:00') AS hour_of_day,
    COUNT(*) AS earthquake_count
FROM earthquakes
GROUP BY DATE_FORMAT(time, '%%H:00'), HOUR(time)
ORDER BY HOUR(time);
""", engine)

query8

   hour_of_day  earthquake_count
0        00:00             22733
1        01:00             22345
2        02:00             22275
3        03:00             22539
4        04:00             22757
5        05:00             22694
6        06:00             22526
7        07:00             22924
8        08:00             22696
9        09:00             22762
10       10:00             22183
11       11:00             21955
12       12:00             22088
13       13:00             22087
14       14:00             21554
15       15:00             21743
16       16:00             21854
17       17:00             22689
18       18:00             22702
19       19:00             23225
20       20:00             22633
21       21:00             22397
22       22:00             22072
23       23:00             22285

In [ ]:
Query 9 : Most active reporting network (net)

In [8]:
query9 = pd.read_sql("""
SELECT 
    net,
    COUNT(*) AS report_count
FROM earthquakes
GROUP BY net
ORDER BY report_count DESC;
""", engine)

query9

       net  report_count
0       ak        170637
1       us        108971
2       nc         51793
3       ci         47070
4       hv         40224
5       tx         29295
6       pr         21237
7       nn         17858
8       ok         13156
9       uu         11101
10      uw          8698
11      mb          7637
12      av          7322
13      nm          1867
14      se           834
15  iscgem            16
16      ew             2

### Casualties & Economic Loss

In [ ]:
Query 10 : Top 5 places with highest casualties

In [9]:
query10 = pd.read_sql("""
SELECT 
    place,
    SUM(sig) AS total_impact_score
FROM earthquakes
GROUP BY place
ORDER BY total_impact_score DESC
LIMIT 5;
""", engine)

query10

                              place  total_impact_score
0     South Sandwich Islands region           1027382.0
1           Kermadec Islands region            616762.0
2         south of the Fiji Islands            565412.0
3  southeast of the Loyalty Islands            361479.0
4                       Fiji region            359097.0

In [ ]:
Query 11 : Average economic loss by alert level

In [10]:
query11 = pd.read_sql("""
SELECT 
    status,
    AVG(sig) AS avg_economic_impact
FROM earthquakes
GROUP BY status
ORDER BY avg_economic_impact DESC;
""", engine)
query11

      status  avg_economic_impact
0   reviewed              98.8175
1  automatic              46.4890

### Event Type & Quality Metrics

In [ ]:
Query 12 : Count of reviewed vs automatic earthquakes (status)

In [11]:
query12 = pd.read_sql("""
SELECT 
    status,
    COUNT(*) AS total_earthquakes
FROM earthquakes
GROUP BY status
ORDER BY total_earthquakes DESC;
""", engine)

query12

      status  total_earthquakes
0   reviewed             486947
1  automatic              50771

In [ ]:
Query 13 : Count by earthquake type (type)

In [12]:
query13 = pd.read_sql("""
SELECT 
    type,
    COUNT(*) AS total_earthquakes
FROM earthquakes
GROUP BY type;
""", engine)

query13

                      type  total_earthquakes
0               earthquake             521388
1                explosion               4379
2         mining explosion               1067
3                ice quake               4030
4             quarry blast               6529
5              other event                251
6               rock burst                  3
7            mine collapse                  7
8       chemical explosion                 10
9   experimental explosion                  4
10            not reported                  5
11              sonic boom                  2
12       volcanic eruption                 12
13               landslide                 31

In [ ]:
Query 14 : Number of earthquakes by data type (types)

In [13]:
query14 = pd.read_sql("""
SELECT types,COUNT(*) AS total_earthquakes
FROM earthquakes
GROUP BY types
ORDER BY total_earthquakes DESC
LIMIT 10;
""", engine)

query14

                                               types  total_earthquakes
0                                ,origin,phase-data,             397925
1     ,nearby-cities,origin,phase-data,scitech-link,              52412
2  ,focal-mechanism,nearby-cities,origin,phase-da...              22706
3                           ,dyfi,origin,phase-data,              18604
4                  ,nearby-cities,origin,phase-data,              10525
5  ,dyfi,focal-mechanism,nearby-cities,origin,pha...               6100
6                ,earthquake-name,origin,phase-data,               5642
7  ,dyfi,nearby-cities,origin,phase-data,scitech-...               4356
8                                           ,origin,               2916
9                       ,origin,phase-data,shakemap,               1728

In [ ]:
Query 15 : Events with high station coverage (nst > threshold)

In [14]:
query15 = pd.read_sql("""
SELECT *
FROM earthquakes
WHERE nst > 50
LIMIT 10;
""", engine)

query15

,id,time,updated,latitude,longitude,depth_km,mag,magType,place,status,...,ids,sources,type,country,year,month,day,day_of_week,depth_flag,destructive_flag
0,hv72336852,2021-01-31 22:23:17,2022-08-09 02:42:49,19.207000,-155.500667,35.27,2.68,md,"2 km W of P?hala, Hawaii",reviewed,...,",hv72336852,us6000ddhv,",",hv,us,",earthquake,Hawaii,2021,1,31,Sunday,shallow,normal
1,ci39537047,2021-01-31 20:42:01,2021-04-16 19:02:42,33.171000,-115.649000,5.12,2.57,ml,"14km WNW of Calipatria, CA",reviewed,...,",ci39537047,us6000ddh0,",",ci,us,",earthquake,CA,2021,1,31,Sunday,shallow,normal
2,ci39537023,2021-01-31 20:36:43,2021-02-02 18:59:57,33.171833,-115.647667,5.08,1.86,ml,"13km WNW of Calipatria, CA",reviewed,...,",ci39537023,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
3,ci39536935,2021-01-31 18:51:42,2021-02-01 14:48:21,33.209667,-116.732500,11.99,1.40,ml,"5km SE of Lake Henshaw, CA",reviewed,...,",ci39536935,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
4,ci39536895,2021-01-31 17:28:46,2021-02-02 16:29:09,33.605667,-116.934833,7.40,1.30,ml,"16km SSE of Hemet, CA",reviewed,...,",ci39536895,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
5,ok2021cdtu,2021-01-31 12:29:08,2021-02-01 17:06:30,35.587333,-97.393500,6.44,1.30,ml,"7 km NE of Lake Aluma, Oklahoma",reviewed,...,",ok2021cdtu,",",ok,",earthquake,Oklahoma,2021,1,31,Sunday,shallow,normal
6,ci39536727,2021-01-31 11:44:59,2021-02-01 22:41:00,33.478167,-116.480833,12.43,2.10,ml,"20km ESE of Anza, CA",reviewed,...,",ci39536727,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
7,ci39536695,2021-01-31 10:44:35,2021-02-01 21:55:43,33.946167,-116.794500,10.11,1.38,ml,"3km NNW of Cabazon, CA",reviewed,...,",ci39536695,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
8,ci39536591,2021-01-31 06:27:55,2021-02-01 14:56:59,33.361000,-116.369833,11.29,1.31,ml,"12km N of Borrego Springs, CA",reviewed,...,",ci39536591,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal
9,ci39536543,2021-01-31 05:23:15,2021-02-03 04:21:00,33.661000,-116.755000,16.07,1.04,ml,"9km SSW of Idyllwild, CA",reviewed,...,",ci39536543,",",ci,",earthquake,CA,2021,1,31,Sunday,shallow,normal

### Tsunamis & Alerts

In [ ]:
Query 16 : Number of tsunamis triggered per year

In [15]:
query16 = pd.read_sql("""
SELECT 
    year,
    COUNT(*) AS tsunami_events
FROM earthquakes
WHERE tsunami = 1
GROUP BY year
ORDER BY year;
""", engine)

query16

   year  tsunami_events
0  2021             114
1  2022             136
2  2023             119
3  2024             114
4  2025             142
5  2026              12

In [ ]:
Query 17 : Count earthquakes by alert levels(red, orange, etc.)

In [16]:
query17 = pd.read_sql("""
SELECT 
  CASE
    WHEN sig >= 600 THEN 'red'
    WHEN sig >= 400 THEN 'orange'
    WHEN sig >= 200 THEN 'yellow'
    ELSE 'green'
  END AS alert_level,
  COUNT(*) AS total_earthquakes
FROM earthquakes
WHERE sig IS NOT NULL
GROUP BY alert_level
ORDER BY total_earthquakes DESC;
""", engine)

query17

  alert_level  total_earthquakes
0       green             450416
1      yellow              79750
2      orange               6823
3         red                729

### Seismic Pattern & Trends Analysis

In [ ]:
Query 18 : Find the top 5 countries with the highest average magnitude of earthquakes in the past 10 years

In [18]:
query18 = pd.read_sql("""
SELECT 
    place AS region,
    AVG(mag) AS avg_magnitude
FROM earthquakes
WHERE year >= YEAR(CURDATE()) - 10
GROUP BY place
ORDER BY avg_magnitude DESC
LIMIT 5;
""", engine)

query18

                                              region  avg_magnitude
0        2025 Kamchatka Peninsula, Russia Earthquake            8.8
1                    2021 Chignik, Alaska Earthquake            8.2
2      2021 Kermadec Islands, New Zealand Earthquake            8.1
3             2021 South Sandwich Islands Earthquake            8.1
4  Pazarcik earthquake, Kahramanmaras earthquake ...            7.8

In [ ]:
Query 19 : Find countries that have experienced both shallow and deep earthquakes within the same month

In [18]:
query19 = pd.read_sql("""
SELECT DISTINCT e1.country
FROM earthquakes e1
JOIN earthquakes e2
  ON e1.country = e2.country
 AND YEAR(e1.time) = YEAR(e2.time)
 AND MONTH(e1.time) = MONTH(e2.time)

WHERE e1.depth_km < 70        -- shallow
  AND e2.depth_km > 300       -- deep
  AND e1.country IS NOT NULL
  AND e1.country <> ''
  AND e1.country <> 'Unknown';

""",engine)

query19

                     country
0          Wallis and Futuna
1                       Fiji
2                  Indonesia
3   Northern Mariana Islands
4                      Japan
5                Philippines
6                Timor Leste
7                      Tonga
8               Japan region
9           Papua New Guinea
10                     Italy
11                 Argentina
12                    Russia
13               Afghanistan
14           Solomon Islands
15                   Vanuatu
16                      Peru
17               New Zealand
18                   Bolivia
19                     China
20                    Brazil
21                      Guam

In [ ]:
Query 20 : Compute the year-over-year growth rate in the total number of earthquakes globally

In [8]:
query20 = pd.read_sql("""
WITH yearly_counts AS (
    SELECT YEAR(time) AS year,
    COUNT(*) AS total_earthquakes
    FROM earthquakes
    GROUP BY YEAR(time)
),

growth_calc AS (
    SELECT  year,total_earthquakes,
        LAG(total_earthquakes) OVER (ORDER BY year) AS prev_year_count
     FROM yearly_counts
)

SELECT year,total_earthquakes,prev_year_count,
        ROUND(
        ((total_earthquakes - prev_year_count) / prev_year_count) * 100,
        2
    ) AS yoy_growth_percent
FROM growth_calc
WHERE prev_year_count IS NOT NULL
AND year < 2026   -- exclude incomplete year
ORDER BY year;
""", engine)

query20

   year  total_earthquakes  prev_year_count  yoy_growth_percent
0  2022             107448           117512               -8.56
1  2023             106802           107448               -0.60
2  2024             107362           106802                0.52
3  2025              93335           107362              -13.07

In [ ]:
Query 21 : List the 3 most seismically active regions by combining both frequency and average magnitude

In [10]:
query21 = pd.read_sql("""
SELECT 
    country,
    COUNT(*) AS frequency,
    AVG(mag) AS avg_magnitude,
    (COUNT(*) * AVG(mag)) AS seismic_score
FROM earthquakes
WHERE country IS NOT NULL AND country <> ''
AND country<>'Unknown'
GROUP BY country
ORDER BY seismic_score DESC
LIMIT 3;
""", engine)

query21

  country  frequency  avg_magnitude  seismic_score
0  Alaska     192624       1.783582  343560.696122
1      CA      95785       1.523629  145940.801117
2  Hawaii      40294       1.993133   80311.320025

### Depth, Location & Distance-Based Analysis

In [ ]:
Query 22 : For each country, calculate the average depth of earthquakes within 5 latitude range of the equator

In [11]:
query22 = pd.read_sql("""
SELECT 
    country,
    AVG(depth_km) AS avg_depth_near_equator
FROM earthquakes
WHERE latitude BETWEEN -5 AND 5
  AND country IS NOT NULL
  AND country <> ''
GROUP BY country
ORDER BY avg_depth_near_equator DESC;
""", engine)

query22

                             country  avg_depth_near_equator
0                        Philippines              124.892832
1                   Papua New Guinea               71.209011
2                               Peru               65.394867
3                          Indonesia               64.034534
4                            Ecuador               60.256599
5                           Colombia               39.602407
6                            Unknown               24.047124
7                          Venezuela               11.127000
8                           Malaysia               11.016667
9                             Brazil               10.556000
10                            Rwanda               10.441538
11                            Guyana               10.351429
12                           Burundi               10.000000
13                            Uganda               10.000000
14                          Tanzania               10.000000
15                   Kiribati region               10.000000
16                       South Sudan               10.000000
17                            Panama               10.000000
18                    Ecuador region               10.000000
19                             Palau               10.000000
20                          Ethiopia               10.000000
21  Democratic Republic of the Congo                9.914739
22                             Gabon                9.818182
23                             Kenya                9.799000

In [ ]:
Query 23 : Identify countries having the highest ratio of shallow to deep earthquakes

In [12]:
query23 = pd.read_sql("""
SELECT 
    country,
    SUM(CASE WHEN depth_km < 70 THEN 1 ELSE 0 END) AS shallow_count,
    SUM(CASE WHEN depth_km > 300 THEN 1 ELSE 0 END) AS deep_count,
    ROUND(
        SUM(CASE WHEN depth_km < 70 THEN 1 ELSE 0 END) /
        NULLIF(SUM(CASE WHEN depth_km > 300 THEN 1 ELSE 0 END), 0),
    2) AS shallow_deep_ratio
FROM earthquakes
WHERE country IS NOT NULL 
  AND country <> ''
GROUP BY country
HAVING deep_count > 0
ORDER BY shallow_deep_ratio DESC
LIMIT 10;
""", engine)

query23

            country  shallow_count  deep_count  shallow_deep_ratio
0             China         1249.0         1.0             1249.00
1              Peru          667.0         1.0              667.00
2              Guam          441.0         1.0              441.00
3       Afghanistan          246.0         1.0              246.00
4       New Zealand         1350.0        10.0              135.00
5   Solomon Islands          674.0         8.0               84.25
6            Russia         4972.0        94.0               52.89
7           Vanuatu         1027.0        22.0               46.68
8             Japan         3717.0       116.0               32.04
9  Papua New Guinea         2227.0        70.0               31.81

In [ ]:
Query 24 : Find the average magnitude difference between earthquakes with tsunami alerts and those without

In [13]:
query24 = pd.read_sql("""
SELECT 
CASE 
  WHEN tsunami = 1 THEN 'Tsunami'
  ELSE 'Non-Tsunami'
END AS tsunami_flag,
AVG(mag) AS avg_magnitude,
COUNT(*) AS total_events
FROM earthquakes
GROUP BY tsunami_flag ;
""", engine)

query24

  tsunami_flag  avg_magnitude  total_events
0  Non-Tsunami       2.173970        537081
1      Tsunami       5.416446           637

In [ ]:
Query 25 : Using the gap and rms columns, identify events with the lowest data reliability (highest average error margins)

In [14]:
query25 = pd.read_sql("""
SELECT 
    id,
    place,
    gap,
    rms,
    (gap + rms) AS error_score
FROM earthquakes
WHERE gap IS NOT NULL AND rms IS NOT NULL
ORDER BY error_score DESC
LIMIT 20;
""", engine)

query25

,id,place,gap,rms,error_score
0,uw61988777,"9 km N of Peaceful Valley, Washington",360.00,0.5000,360.5000
1,ci40440272,"8km SE of Avalon, CA",360.00,0.2200,360.2200
2,ci39657847,"8km SE of Avalon, CA",360.00,0.2100,360.2100
3,ci39623194,"8km SE of Avalon, CA",360.00,0.1900,360.1900
4,nn00907449,"59 km NE of Valmy, Nevada",360.00,0.1436,360.1436
5,ci37542821,"12 km SSE of Bombay Beach, CA",359.00,0.2000,359.2000
6,uw61806116,"1 km W of Bethel, Washington",359.00,0.0600,359.0600
7,nn00897599,"60 km NE of Valmy, Nevada",358.18,0.1601,358.3401
8,pr2024051000,"77 km NW of Sandy Ground Village, Anguilla",358.00,0.1600,358.1600
9,ci37545061,"12 km W of Niland, CA",357.00,0.1000,357.1000
10,us7000denb,"Andreanof Islands, Aleutian Islands, Alaska",355.00,0.3400,355.3400
11,nn00844111,"21 km NE of Goldfield, Nevada",354.93,0.1938,355.1238
12,nn00854298,"46 km NW of Carlin, Nevada",354.18,0.1136,354.2936
13,nn00833981,"34 km SSW of Alamo, Nevada",354.12,0.1428,354.2628
14,pr2022227000,"59 km ENE of Cruz Bay, U.S. Virgin Islands",353.00,0.6100,353.6100
15,us7000pelq,"106 km S of Atka, Alaska",353.00,0.4700,353.4700
16,nn00853821,"40 km SW of Alamo, Nevada",353.21,0.0410,353.2510
17,av91051023,"Rat Islands, Aleutian Islands, Alaska",353.00,0.0500,353.0500
18,nn00855030,"28 km NE of Indian Springs, Nevada",352.54,0.2012,352.7412
19,nn00850772,"25 km NW of Carlin, Nevada",352.54,0.0506,352.5906

In [ ]:
Query 26 : Determine the regions with the highest frequency of deep-focus earthquakes (depth > 300 km)

In [16]:
query26 = pd.read_sql("""
SELECT 
    country AS region,
    COUNT(*) AS deep_focus_events,
    AVG(depth_km) AS avg_depth_km,
    AVG(mag) AS avg_magnitude
FROM earthquakes
WHERE depth_km > 300
  AND country IS NOT NULL
  AND country <> ''
  AND country <> 'Unknown'
GROUP BY country
ORDER BY deep_focus_events DESC
LIMIT 10;
""", engine)

query26

                     region  deep_focus_events  avg_depth_km  avg_magnitude
0                      Fiji               1116    564.654307       4.324014
1                     Tonga                554    470.171114       4.305776
2                 Indonesia                264    459.873045       4.414773
3              Japan region                230    447.145009       4.304783
4               Timor Leste                201    446.543274       4.324378
5         Wallis and Futuna                155    408.660174       4.344516
6  Northern Mariana Islands                117    438.476581       4.167521
7                     Japan                116    360.923069       4.385345
8               Philippines                114    522.542026       4.281579
9                    Russia                 94    418.151872       4.350000